Reading Table, Csv, knowing about dataframe and series

In [2]:
import pandas as pd

In [3]:
#read_table uses tab as default separator

orders=pd.read_table('http://bit.ly/chiporders')

In [4]:
#head() used see first 5 rows

orders.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39

In [5]:
#example of reading a table separeted by | and with no header & giving names to the columns

colnames=['id','age','gender','occupation','zipcode']
users=pd.read_table('http://bit.ly/movieusers',sep='|',header=None,names=colnames)
users.head(3)

   id  age gender  occupation zipcode
0   1   24      M  technician   85711
1   2   53      F       other   94043
2   3   23      M      writer   32067

In [6]:
#read_csv uses , as default separator

ufo=pd.read_csv('http://bit.ly/uforeports')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [ ]:
# to read only a few columns from the csv file

t1=pd.read_csv('http://bit.ly/uforeports', usecols=['City','State'])

# or can use index in the list
t2=pd.read_csv('http://bit.ly/uforeports', usecols=[0,3])

In [ ]:
# to read only few rows from csv

t3=pd.read_csv('http://bit.ly/uforeports', nrows=10)

In [ ]:
# iterating through series values

for c in ufo.City:
    print(c)

In [ ]:
# iterating through rows of a dataframe

for index, row in ufo.iterrows():
    print(index,row.City,row.State)

In [7]:
#type() used to finnd the type of the object

type(ufo)
type(ufo['City'])

pandas.core.series.Series

In [8]:
# shape used to find the no of rows and columns

ufo.shape

(18241, 5)

In [9]:
# Accessing  series

ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [10]:
# always works when series are accessed using []

ufo['Colors Reported']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, Length: 18241, dtype: object

In [12]:
'Shuhin'+' Vinoth kannan'

'Shuhin Vinoth kannan'

In [13]:
# Creating new column
ufo['Location']=ufo.City+','+ufo.State

In [15]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca,NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro,NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke,CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene,KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair,NY"

In [16]:
movies=pd.read_csv('http://bit.ly/imdbratings')
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [ ]:
# dtypes gives the data types of each columns in the dataframe - object means string
movies.dtypes

In [22]:
movies.shape

(979, 6)

In [23]:
#describe() gives descriptive statistics of all numeric columns
movies.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

Note:
movies is a dataframe object.
head(), describe() are the methods of the object.(eg:) shuhin.eat(),shuhin.walk()
shape, dtype are the attributes of the object. (eg:) shuhin.age,shuhin.color

In [24]:
# to describe a string
movies.describe(include=['object'])

,title,content_rating,genre,actors_list
count,979,976,979,979
unique,975,12,16,969
top,The Girl with the Dragon Tattoo,R,Drama,"[u'Daniel Radcliffe', u'Emma Watson', u'Rupert..."
freq,2,460,278,6

In [25]:
movies.columns

Index(['star_rating', 'title', 'content_rating', 'genre', 'duration',
       'actors_list'],
      dtype='object')

####################################################
How do I rename column names using different method:
####################################################

In [26]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time',
       'Location'],
      dtype='object')

In [31]:
#Method1: rename

ufo.rename(columns={'Colors Reported':'Colors_Reported','Shape Reported':'Shape_Reported'})

,City,Colors_Reported,Shape_Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca,NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro,NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke,CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene,KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair,NY"
...,...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00,"Grant Park,IL"
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00,"Spirit Lake,IA"
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45,"Eagle River,WI"
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45,"Eagle River,WI"
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59,"Ybor,FL"

In [32]:
#Method 2: create a list and replace

ufo_cols=['city','colors','shape','state','time','loc']

In [33]:
ufo.columns=ufo_cols

In [34]:
ufo.columns

Index(['city', 'colors', 'shape', 'state', 'time', 'loc'], dtype='object')

In [35]:
#Method 3: Can rename the columns while reading the file itself

orders.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [36]:
ord_cols=['id','quantity','item','descrip','price']

In [37]:
orders=pd.read_table('http://bit.ly/chiporders',names=ord_cols,header=0)

In [39]:
orders.columns

Index(['id', 'quantity', 'item', 'descrip', 'price'], dtype='object')

In [40]:
# Method 4: If you need to rename more columns
movies.columns

Index(['star_rating', 'title', 'content_rating', 'genre', 'duration',
       'actors_list'],
      dtype='object')

In [46]:
movies.columns=movies.columns.str.replace('_',' ')

In [47]:
movies.columns

Index(['starrating', 'title', 'contentrating', 'genre', 'duration',
       'actorslist'],
      dtype='object')

############################
How to drop a column from df
############################

In [48]:
ufo.columns

Index(['city', 'colors', 'shape', 'state', 'time', 'loc'], dtype='object')

In [49]:
# Method 1: to drop column, axis=1 (column axis) axis=0 (row axis) : inplace =True means it takes place in the df itself

ufo.drop('loc',axis=1,inplace=True)

In [50]:
ufo.head()

                   city colors     shape state             time
0                Ithaca    NaN  TRIANGLE    NY   6/1/1930 22:00
1           Willingboro    NaN     OTHER    NJ  6/30/1930 20:00
2               Holyoke    NaN      OVAL    CO  2/15/1931 14:00
3               Abilene    NaN      DISK    KS   6/1/1931 13:00
4  New York Worlds Fair    NaN     LIGHT    NY  4/18/1933 19:00

In [51]:
# Method 2: to drop a list of columns

ufo.drop(['colors','shape'],axis=1,inplace=True)

In [52]:
ufo.head()

                   city state             time
0                Ithaca    NY   6/1/1930 22:00
1           Willingboro    NJ  6/30/1930 20:00
2               Holyoke    CO  2/15/1931 14:00
3               Abilene    KS   6/1/1931 13:00
4  New York Worlds Fair    NY  4/18/1933 19:00

#############################
To drop rows using drop()
#############################

In [54]:
ufo.drop([0,1,2],axis=0,inplace=True)

In [55]:
ufo.head()

                   city state             time
3               Abilene    KS   6/1/1931 13:00
4  New York Worlds Fair    NY  4/18/1933 19:00
5           Valley City    ND  9/15/1934 15:30
6           Crater Lake    CA   6/15/1935 0:00
7                  Alma    MI   7/15/1936 0:00

In [56]:
ufo.shape

(18238, 3)

##################################
To sort a series
##################################

In [58]:
# sort by values : defualt is AScending

ufo['city'].sort_values(ascending=False)

6001                     south of the border
1560                           on plane wing
12454    observer enroute on MN hwy 61 north
6786                               not shure
1438                                    none
                        ...
12441                                    NaN
15767                                    NaN
15812                                    NaN
16054                                    NaN
16608                                    NaN
Name: city, Length: 18238, dtype: object

###############################
To sort a dataframe by a series
###############################

In [60]:
ufo.sort_values('state',ascending=False)

                     city state              time
10828            Cheyenne    WY   10/5/1997 19:00
7491              Gilette    WY   8/15/1994 22:00
3982        Interstate 80    WY  11/17/1978 15:00
6816              Laramie    WY   6/24/1992 22:00
2267               Powell    WY     7/5/1972 1:00
...                   ...   ...               ...
18116          North Pole    AK  12/12/2000 22:00
14185      Turnagain Pass    AK    8/14/1999 4:00
467    St Lawrence Island    AK  11/10/1957 20:00
2304            Anchorage    AK    8/30/1972 1:30
3146            Ft. Yukon    AK    2/3/1976 13:00

[18238 rows x 3 columns]

####################
Sort a dataframe with multiple columns
###################

In [62]:
ufo.sort_values(['state','city'],ascending=[True,False])

                city state             time
5809         Wasilla    AK   4/15/1988 7:00
8668         Wasilla    AK   9/15/1995 2:00
10991        Wasilla    AK  11/17/1997 3:00
12876        Wasilla    AK   1/8/1999 22:45
13552    Wacker City    AK  5/26/1999 18:00
...              ...   ...              ...
16594         Casper    WY  6/13/2000 22:00
13823        Buffalo    WY   7/1/1999 22:30
17640         Border    WY  10/9/2000 18:45
17183  Big Horn Mtns    WY  8/13/2000 20:00
10729  Atlantic City    WY  8/22/1997 23:30

[18238 rows x 3 columns]

#### to drop the non numeric columns from a dataframe

In [3]:
import pandas as pd
import numpy as np

In [5]:
drinks=pd.read_csv('http://bit.ly/drinksbycountry')

In [6]:
# to check the data types of the df

drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [8]:
# dropping the character or string columns

numeric_cols=drinks.select_dtypes(include=[np.number])

In [9]:
numeric_cols.dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

In [13]:
drinks.describe(include='all')

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
count,193,193.000000,193.000000,193.000000,193.000000,193
unique,193,NaN,NaN,NaN,NaN,6
top,St. Kitts & Nevis,NaN,NaN,NaN,NaN,Africa
freq,1,NaN,NaN,NaN,NaN,53
mean,NaN,106.160622,80.994819,49.450777,4.717098,NaN
std,NaN,101.143103,88.284312,79.697598,3.773298,NaN
min,NaN,0.000000,0.000000,0.000000,0.000000,NaN
25%,NaN,20.000000,4.000000,1.000000,1.300000,NaN
50%,NaN,76.000000,56.000000,8.000000,4.200000,NaN
75%,NaN,188.000000,128.000000,59.000000,7.200000,NaN
max,NaN,376.000000,438.000000,370.000000,14.400000,NaN

In [14]:
drinks.shape

(193, 6)

In [19]:
# axis parameter in mean function axis=0 (columnwise/ 'index'), axis=1 (rowise/ 'columns')

drinks.mean(axis=0)
drinks.mean(axis=1)

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64